/*
Основные процедуры для работы с eeprom
1. Считывание основных параметров таймера (5 параметров - продолжительность раунда (секунды и минуты), продолжительность отдыха (секунды и минуты)
и количество раундов) из eeprom и запись их в соответствующие регистры. Данные в eeprom храняться с двойным резервированием. Соответственно считывание
производится с трёх разных адресов памяти и сравнение полученных данных.
В templ содержится номер считываемого параметра (5 штук). Для каждого параметра считывается из eeprom 3 байта, проверяется, что все они равны. 
Если равны: 
- считанное из eeprom значение записвается в ОЗУ;
- считывается и проверяется следующий параметр;
- при успешном окончании данные из ОЗУ по адресу TIMER_PARAMETERS_TEMP переписываются в соответствующие регистры
если не равны или содержат неверное значение (например значение секунд > 59):
-выход из процедуры без записи в соответствующие регистры. Таким образом, параметры таймера останутся по умолчанию.


2. Чтение байта двнных из eeprom. В XH:XL - адрес считываемого байта. В YL - считанный байт

3. 
*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////	1
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Read_timer_parameters_from_eeprom:
	ldi		templ,FIRST_PAGE_BEGIN
	
next_param_from_eeprom:
	mov		XL,templ										;считывание первого байта
	clr		XH
	call	Read_byte_from_eeprom
	mov		temph,YL
	adiw	XL,SECOND_PAGE_BEGIN							;считывание второго байта
	call	Read_byte_from_eeprom
	mov		temp_2,YL
	adiw	XL,THIRD_PAGE_BEGIN								;считывание третьего байта
	call	Read_byte_from_eeprom
	mov		temp_3,YL

	//проверка считанного байта - если битый или содержит неверное значение
	cp		temph,temp_2
	brne	exit_read_timer_parameters_from_eeprom
	cp		temp_2,temp_3
	brne	exit_read_timer_parameters_from_eeprom
	sbrs	templ,0											;если нулевой бит=1, то были считаны секунды 
	rjmp	check_minutes_or_rounds							;если нулевой бит=1, то были считаны минуты или раунды
	cpi		temph,60										;секунд д.б. меньше 60
	brsh	exit_read_timer_parameters_from_eeprom
	rjmp	check_param_number
check_minutes_or_rounds:
	cpi		temph,100										;минут или раундов д.б. меньше 100
	brsh	exit_read_timer_parameters_from_eeprom
			
check_param_number:
	
			
exit_read_timer_parameters_from_eeprom:
ret

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////	2
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Read_byte_from_eeprom:

	sbic	EECR,EEWE
	rjmp	Read_byte_from_eeprom

	out		EEARH,XH
	out		EEARL,XL

	sbi		EECR,EERE

	in		YL,EEDR

ret


.dseg 

TIMER_PARAMETERS_TEMP:	.byte	5

.cseg