/*
Основные процедуры для корректировки времени часов

1. Корректировка времени часов. В связи с тем, что в процессе работы часов в течении определенного времени, из-за неидеальной точности работы кварцевого 
резонатора, возникает погрешность определения времени микросхемой DS1307. Поэтому каждые сутки, в определённое время, происходит корректировка часов. Для этого
нужно самостоятельно определить значение ухода времени в секундах за сутки для каждой конкретной модели часов.
*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////							1
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Correct_time:
	
ret