/*
ќсновные процедуры дл€ корректировки времени часов

1.  орректировка времени часов. ¬ св€зи с тем, что в процессе работы часов в течении определенного времени, из-за неидеальной точности работы кварцевого 
резонатора, возникает погрешность определени€ времени микросхемой DS1307. ѕоэтому каждые сутки, в определЄнное врем€, происходит корректировка часов. ƒл€ этого
нужно самосто€тельно определить значение ухода времени в секундах за сутки дл€ каждой конкретной модели часов.

2. —читывание из пам€ти программ поправочного коэффициента (уход времени в секундах за сутки) и запись полученного значени€ в оперативную
пам€ть. ѕроизводитс€ сразу после включени€ часов и начала работы программы.
*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////							1
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Correct_time:
	ldi		XL,LOW(TIME_INACCURACY_SEC_PER_DAY_TEMP)					;адрес хранени€ значени€ ухода времени в оперативной пам€ти
	ldi		XH,HIGH(TIME_INACCURACY_SEC_PER_DAY_TEMP)
	ld		temph,X

	//считывание текущего времени - сначала часы
	ldi		XL,LOW(TWI_BUFFER_IN)
	ldi		XH,HIGH(TWI_BUFFER_IN)
	adiw	XL,2
	ld		templ,X
	//проверка значени€ часов, минут и секунд
	cpi		templ, 1
	brne	exit_correct_time_proc
	ld		templ,-X													;минуты
	cpi		templ,0
	brne	exit_correct_time_proc
	ld		templ,-X													;секунды
	cpi		templ,0
	brne	check_stop_correction_time	
	//проверка значени€ ошибки часов - если значение отрицательное - отстают, иначе - спешат
	sbrs	temph,7														
	rjmp	clock_ahead
	//если отстают - записать в датчик значение секунд и выйти
	neg		temph														;модуль отрицательного числа
	call	HEX_TO_BCD													;перевести в формат bcd дл€ записи в датчик
	clr		byte_address
	call	Write_byte_to_DS1307
	rjmp	exit_correct_time_proc

	//если часы спешат
	clock_ahead:
	sbr		state_flag,WWSM												;установка флага, который сигнализирует, что будет производитс€ коррекци€ времени
	
check_stop_correction_time:

exit_correct_time_proc:
ret

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////							2
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Read_write_time_inaccuracy:	
	ldi		ZL,LOW(2*TIME_INACCURACY_SEC_PER_DAY_CONST)					;адрес хранени€ значени€ ухода времени во флеш-пам€ти
	ldi		ZH,HIGH(2*TIME_INACCURACY_SEC_PER_DAY_CONST)
	lpm		templ,Z
	
	ldi		XL,LOW(TIME_INACCURACY_SEC_PER_DAY_TEMP)					;адрес хранени€ значени€ ухода времени в оперативной пам€ти
	ldi		XH,HIGH(TIME_INACCURACY_SEC_PER_DAY_TEMP)
	st		X,templ
ret

.dseg 

TIME_INACCURACY_SEC_PER_DAY_TEMP:	.byte	1

CORRECTION_FLAG:	.byte	1

.cseg

TIME_INACCURACY_SEC_PER_DAY_CONST:
		.db		0x06,	0x00

TIME_INACCURACY_MIN_PER_DAY_CONST:
		.db		0x06,	0x00
