/*
Основные процедуры для корректировки времени часов

1. Корректировка времени часов. В связи с тем, что в процессе работы часов в течении определенного времени, из-за неидеальной точности работы кварцевого 
резонатора, возникает погрешность определения времени микросхемой DS1307. Поэтому каждые сутки, в определённое время, происходит корректировка часов. Для этого
нужно самостоятельно определить значение ухода времени в секундах за сутки для каждой конкретной модели часов.

2. Считывание из памяти программ поправочного коэффициента (уход времени в секундах за сутки) и запись полученного значения в оперативную
память.
*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////							1
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Correct_time:
	
ret

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////							2
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Read_write_time_inaccuracy:	
	ldi		ZL,LOW(2*TIME_INACCURACY_SEC_PER_DAY_CONST)					;адрес хранения значения ухода времени во флеш-памяти
	ldi		ZH,HIGH(2*TIME_INACCURACY_SEC_PER_DAY_CONST)
	lpm		templ,Z
	
	ldi		XL,LOW(TIME_INACCURACY_SEC_PER_DAY_TEMP)					;адрес хранения значения ухода времени в оперативной памяти
	ldi		XH,HIGH(TIME_INACCURACY_SEC_PER_DAY_TEMP)
	st		X,templ
ret

.dseg 

TIME_INACCURACY_SEC_PER_DAY_TEMP:	.byte	1

.cseg

TIME_INACCURACY_SEC_PER_DAY_CONST:
		.db		0x06,	0x00
